import * as S from '../../styledComponent/styledLayout/StPrepareLayout';
const CartEmpty = () => {
  return (
    <S.NotFoundWrapper>
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="48"
        height="48"
        viewBox="0 0 14 14"
      >
        <path
          fill="none"
          stroke="currentColor"
          stroke-linecap="round"
          stroke-linejoin="round"
          d="M12.88 12.39a1 1 0 0 1-.25.78a1 1 0 0 1-.75.33H2.12a1 1 0 0 1-.75-.33a1 1 0 0 1-.25-.78L2 4.5h10ZM4.5 4.5V3a2.5 2.5 0 0 1 5 0v1.5"
        />
      </svg>

      <h2>
        장바구니에
        <span> 추가된 상품</span>이 없습니다
      </h2>
      <p>
        장바구니가 비어있습니다.
        <br />
        장바구니에 새로운 상품으로 채워보세요.
      </p>
      <S.ToHomeLink to={'/GoodsList/New'}>
        실시간 신상품 보러가기{' '}
        <svg
          width="24"
          height="24"
          viewBox="0 0 24 24"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M9.00008 18.0001C8.99962 17.7664 9.081 17.54 9.23008 17.3601L13.7101 12.0001L9.39008 6.63006C9.30701 6.52778 9.24498 6.41008 9.20755 6.28374C9.17012 6.1574 9.15803 6.02491 9.17196 5.89388C9.1859 5.76285 9.2256 5.63587 9.28877 5.52024C9.35195 5.4046 9.43735 5.30259 9.54008 5.22006C9.64237 5.137 9.76006 5.07497 9.8864 5.03754C10.0127 5.0001 10.1452 4.98801 10.2763 5.00195C10.4073 5.01589 10.5343 5.05559 10.6499 5.11876C10.7655 5.18193 10.8676 5.26734 10.9501 5.37006L15.7801 11.3701C15.9272 11.549 16.0076 11.7734 16.0076 12.0051C16.0076 12.2367 15.9272 12.4611 15.7801 12.6401L10.7801 18.6401C10.6961 18.7413 10.593 18.825 10.4767 18.8864C10.3603 18.9477 10.233 18.9855 10.1021 18.9976C9.97107 19.0097 9.839 18.9958 9.7134 18.9568C9.58779 18.9177 9.47113 18.8543 9.37008 18.7701C9.25537 18.677 9.16269 18.5597 9.09872 18.4266C9.03474 18.2934 9.00106 18.1478 9.00008 18.0001Z"
            fill="var(--color-primary)"
          />
        </svg>
      </S.ToHomeLink>
    </S.NotFoundWrapper>
  );
};

export default CartEmpty;
